//IBMUSERC JOB (COM),'COMP COB CICS DB2',MSGLEVEL=(1,1),MSGCLASS=A,
//         REGION=0M,CLASS=A,NOTIFY=&SYSUID
//DD1 SET SRCLIB=ACADEMIA.COBOL.MAPAS         -->  SOURCE LIBRARY
//DD2 SET DBRMLIB=ACADEMIA.COBOL.DBRMLIB      -->  DBRM LIBRARY
//DD3 SET MEM=PRAC05                   -->  MEMBER NAME PROGRAMA
//DD4 SET DCLLIB=ACADEMIA.COBOL.DCLGEN     -->  DCLGEN LIBRARY
//DD5 SET COPYLIB=ACADEMIA.COBOL.COPYS     -->  SYMBOLIC MAP
//DD6 SET LOADLIB=DFH320.CICS.SDFHLOAD     **   DO NOT CHANGE  **
//DD7 SET BMSLIB=ACADEMIA.COBOL.COPYS     -->  SYMBOLIC MAP
//DDA SET LNKPARM='XREF'
//DDB SET WORK=USR002
//*
//*   1. PRECOMPILER
//*
//PRECOMP  EXEC PGM=DSNHPC,
//*        PARM='HOST(COBOL),APOST,SOURCE,LEVEL(GLM)'
//         PARM='HOST(IBMCOB),NOSOURCE,APOST,APOSTSQL'
//STEPLIB  DD DISP=SHR,DSN=DSN910.DB9G.SDSNEXIT
//          DD DISP=SHR,DSN=DSN910.SDSNLOAD
//DBRMLIB  DD  DISP=SHR,DSN=&DBRMLIB(&MEM)
//SYSCIN   DD  DSN=&&DSNHOUT,DISP=(MOD,PASS),UNIT=SYSDA,
//             SPACE=(TRK,(10,1),RLSE)
//SYSLIB   DD  DSN=&DCLLIB,DISP=SHR
//         DD  DSN=&COPYLIB,DISP=SHR
//SYSTERM  DD  SYSOUT=*
//SYSDUMP  DD  SYSOUT=*
//SYSPRINT DD  SYSOUT=*
//SYSIN    DD  DSN=&SRCLIB(&MEM),DISP=SHR
//SYSUT1   DD  SPACE=(TRK,(10,1),RLSE),UNIT=SYSDA,
//         VOL=SER=&WORK
//SYSUT2   DD  SPACE=(TRK,(10,1),RLSE),UNIT=SYSDA,
//         VOL=SER=&WORK
//*
//* 2. CICS TRANSALATION
//*
//TRANSL   EXEC PGM=DFHECP1$,PARM='COBOL2',
//         COND=(5,LT)
//STEPLIB  DD DSN=DFH320.CICS.SDFHLOAD,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSIN    DD  DSN=&&DSNHOUT,DISP=(MOD,PASS),UNIT=SYSDA
//SYSPUNCH DD DSN=&&SYSCIN,
//         DISP=(,PASS),UNIT=SYSDA,
//         DCB=BLKSIZE=400,
//         SPACE=(TRK,(10,1),RLSE)
//*
//* 3. COMPILATION
//*
//COBOL    EXEC PGM=IGYCRCTL,COND=(5,LT),
//*        PARM='NODYNAM,LIB,OBJECT,RENT,RES,APOST',COND=(5,LT)
//         PARM='NODYNAM,LIB,OBJECT,RENT,APOST,MAP,XREF'
//STEPLIB  DD DSN=IGY410.SIGYCOMP,DISP=SHR
//SYSLIB   DD DSN=DFH320.CICS.SDFHCOB,DISP=SHR
//         DD DSN=DFH320.CICS.SDFHMAC,DISP=SHR
//         DD DSN=DFH320.CICS.SDFHSAMP,DISP=SHR
//         DD DSN=&COPYLIB,DISP=SHR
//         DD DSN=&BMSLIB,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSIN    DD DSN=&&SYSCIN,DISP=(OLD,DELETE)
//SYSLIN   DD DSN=&&LOADSET,DISP=(MOD,PASS),
//         UNIT=SYSDA,SPACE=(80,(250,100))
//SYSUT1   DD UNIT=SYSDA,SPACE=(TRK,(10,1),RLSE),VOL=SER=&WORK
//SYSUT2   DD UNIT=SYSDA,SPACE=(TRK,(10,1),RLSE),VOL=SER=&WORK
//SYSUT3   DD UNIT=SYSDA,SPACE=(TRK,(10,1),RLSE),VOL=SER=&WORK
//SYSUT4   DD UNIT=SYSDA,SPACE=(TRK,(10,1),RLSE),VOL=SER=&WORK
//SYSUT5   DD UNIT=SYSDA,SPACE=(TRK,(10,1),RLSE),VOL=SER=&WORK
//SYSUT6   DD UNIT=SYSDA,SPACE=(TRK,(10,1),RLSE),VOL=SER=&WORK
//SYSUT7   DD UNIT=SYSDA,SPACE=(TRK,(10,1),RLSE),VOL=SER=&WORK
//*
//* 4. LINK EDIT
//*
//LKED     EXEC PGM=IEWL,COND=(5,LT,COBOL),
//*        PARM=&LNKPARM
//         PARM='LIST,XREF'
//SYSLIB   DD  DSN=DFH320.CICS.SDFHLOAD,DISP=SHR
//         DD  DSN=DFH320.CICS.SDFHCOB,DISP=SHR
//         DD  DSN=CEE.SCEELKED,DISP=SHR
//         DD  DSN=CEE.SCEERUN,DISP=SHR
//         DD  DSN=DSN910.SDSNLOAD,DISP=SHR
//DB2LOAD  DD  DSN=DSN910.SDSNLOAD,DISP=SHR
//SYSLMOD  DD DSN=&LOADLIB(&MEM),DISP=SHR
//SYSUT1   DD UNIT=SYSDA,DCB=BLKSIZE=1024,VOL=SER=&WORK,
//         SPACE=(TRK,(10,1),RLSE)
//SYSPRINT DD SYSOUT=*
//*YSLIN   DD DSN=DFH320.CICS.SDFHCOB(DFHEILIC),DISP=SHR
//SYSLIN   DD DSN=DFH320.CICS.SDFHSAMP(DFHEILID),DISP=SHR
//         DD DSN=&&LOADSET,DISP=(OLD,DELETE)
//SYSIN    DD DUMMY
//*
//********************************************************************
//* Bind *
//********************************************************************
//BIND    EXEC PGM=IKJEFT01,DYNAMNBR=20
//*
//STEPLIB  DD DISP=SHR,DSN=DSN910.DB9G.SDSNEXIT
//         DD DISP=SHR,DSN=DSN910.SDSNLOAD
//         DD DISP=SHR,DSN=CEE.SCEERUN
//*DBRMLIB DD DSN=DSN910.DB9G.DBRMLIB.DATA,DISP=SHR
//DBRMLIB  DD DISP=SHR,DSN=ACADEMIA.COBOL.DBRMLIB(PRAC05)
//SYSUDUMP DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//*
//SYSTSIN DD *
DSN SYSTEM(DB9G)
BIND PACKAGE (PXYZP) MEMBER(PRAC05) -
ACT(REP) ISO(CS) ENCODING(EBCDIC)
BIND PLAN(XYZP) PKLIST(PXYZP.*) -
ACT(REP) ISO(CS) ENCODING(EBCDIC)
RUN PROGRAM(DSNTEP2) PLAN(DSNTEP91) -
LIB('DSN910.DB9G.RUNLIB.LOAD')
END
/*
//SYSIN DD *
//*GRANT EXECUTE, BIND ON PACKAGE PXYZP.* TO PUBLIC;
//*GRANT EXECUTE, BIND ON PLAN XYZP TO PUBLIC;
//*  COMMIT;
  RELEASE ALL;
/*
//
//*GRANT BIND, EXECUTE ON PLAN XYZP TO PUBLIC;
