//DELPS JOB CLASS=A,PRTY=15,MSGCLASS=A,MSGLEVEL=(1,1),                  00010000
//          NOTIFY=&SYSUID                                              00020000
//*--------------------------------------------------------------       00030000
//*             ELIMINA UN PDS (LIBRERIA)                               00040001
//*--------------------------------------------------------------       00050000
//PASO1  EXEC PGM=IEFBR14                                               00060000
//NOMBRE DD   DSN=ACADEMIA.COBOL.PSD,                                   00070001
//            DISP=(OLD,DELETE,DELETE)                                  00080000
/*                                                                      00090000
