//LIST1 JOB  CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1),NOTIFI=&SYSUID
//           PRTY=15
//*---------------------------------------------------------------
//*          LISTAR UN VTOC  CON LA LIBRERIA IEHLIST
//*---------------------------------------------------------------
//PASO1    EXEC PGM=IEHLIST
//DD1      DD   UNIT=DISK,VOLUME=SER=PUB000,DISP=SHR <--VOL OF DATASET
//SYSPRINT DD   SYSOUT=*
//SYSOUT   DD   SYSOUT=*
//SYSIN    DD   *
          LISTVTOC FORMAT,VOLUME=DISK=PUB000
/*
