//JOINKEY  JOB 1,NOTIFY=&SYSUID
//STEP1    EXEC PGM=SORT
//DD1      DD   DSN=ACADEMIA.COBOL.FILE1,DISP=SHR
//DD2      DD   DSN=ADEMIA.COBOL.FILE2,DISP=SHR
//SORTOUT  DD   DSN=ACADEMIA.COBOL.FILE3,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
           SORT FIELDS=COPY
           JOINKEYS F1=DD1,FIELDS=(2,10,A)
           JOINKEYS F2=DD2,FIELDS=(2,10,A)
           JOIN UNPAIRED,F1
           REFORMAT FIELDS=(F1:1,10,F2:1,10)
/*
